# Brewfile — cross-platform CLI tools
# macOS-only casks, mas entries, and macOS formulae live in Brewfile.macos

# -----------------------------------------------------------------------------
# Load-bearing for dotfiles
# -----------------------------------------------------------------------------
brew "stow"
brew "tmux"
brew "neovim"
brew "tig"
brew "ranger"
brew "ripgrep"
brew "bat"
brew "eza"
brew "mise"
brew "mcfly"
brew "oh-my-posh"
brew "diff-so-fancy"
brew "swiftformat"     # referenced by nvim/init.lua as the swift formatter
brew "go"
brew "rustup"
# After install: rustup default stable
# tree-sitter CLI: cargo install tree-sitter-cli

brew "gh"                       # has its own stow package (gh/.config/gh/)
# zsh-autosuggestions and zsh-syntax-highlighting are cloned directly
# into ~/.oh-my-zsh/custom/plugins/ by install.sh

# scm_breeze is installed via its own installer:
# https://github.com/scmbreeze/scm_breeze#installation

# -----------------------------------------------------------------------------
# Day-one dev tools
# -----------------------------------------------------------------------------
brew "act"
brew "age"
brew "cmake"
brew "direnv"
brew "entr"
brew "fd"
brew "findutils"
brew "fswatch"
brew "fzf"
brew "git-extras"
brew "git-lfs"
brew "gnu-sed"
brew "htop"
brew "jq"
brew "lefthook"
brew "mkcert"
brew "moreutils"
brew "ncdu"
brew "ninja"
brew "pandoc"
brew "pipx"
brew "pre-commit"
brew "tealdeer"
brew "trash"
brew "tree"
brew "wget"
brew "yamllint"
brew "yarn"
brew "yq"
