# Brewfile.macos — macOS-only tools, casks, and App Store apps

# -----------------------------------------------------------------------------
# macOS-only formulae
# -----------------------------------------------------------------------------
tap "facebook/fb"
tap "getsentry/xcodebuildmcp"

brew "cocoapods"          # iOS dev
brew "idb-companion"      # companion process for ios-simulator-mcp
brew "mas"                # Mac App Store CLI
brew "pinentry-mac"       # GPG pinentry for macOS
brew "xcodebuildmcp"      # deterministic Xcode MCP startup without npx

# -----------------------------------------------------------------------------
# Terminal / fonts
# -----------------------------------------------------------------------------
cask "ghostty"
cask "font-monaspace"
cask "font-symbols-only-nerd-font"

# -----------------------------------------------------------------------------
# Dev / cloud
# -----------------------------------------------------------------------------
cask "codex"
cask "docker-desktop"
cask "gcloud-cli"
cask "hive-app"

# -----------------------------------------------------------------------------
# Browsers
# -----------------------------------------------------------------------------
cask "brave-browser"
cask "google-chrome"

# -----------------------------------------------------------------------------
# Communication
# -----------------------------------------------------------------------------
cask "signal"
cask "slack"
cask "telegram"

# -----------------------------------------------------------------------------
# AI
# -----------------------------------------------------------------------------
cask "chatgpt"
cask "claude"

# -----------------------------------------------------------------------------
# Passwords / secrets
# -----------------------------------------------------------------------------
cask "1password"
cask "gpg-suite"

# -----------------------------------------------------------------------------
# Databases
# -----------------------------------------------------------------------------
cask "postgres-app"

# -----------------------------------------------------------------------------
# Utilities
# -----------------------------------------------------------------------------
cask "blackhole-16ch"
cask "moom"

# -----------------------------------------------------------------------------
# Vendor downloads (not automatable — re-download from vendor when needed)
# -----------------------------------------------------------------------------
# Drobo Dashboard — https://www.drobo.com/start/
# NDI Tools       — https://ndi.video/tools/

# -----------------------------------------------------------------------------
# Mac App Store
# -----------------------------------------------------------------------------
mas "Xcode", id: 497799835
