# Brewfile.macos — macOS-only tools, casks, and App Store apps

# -----------------------------------------------------------------------------
# macOS-only formulae
# -----------------------------------------------------------------------------
brew "cocoapods"          # iOS dev
brew "mas"                # Mac App Store CLI
brew "pinentry-mac"       # GPG pinentry for macOS
brew "terminal-notifier"  # macOS notifications from scripts

# -----------------------------------------------------------------------------
# Terminal / fonts
# -----------------------------------------------------------------------------
cask "ghostty"
cask "font-monaspace"

# -----------------------------------------------------------------------------
# Creative suite
# -----------------------------------------------------------------------------
cask "adobe-creative-cloud"

# -----------------------------------------------------------------------------
# Dev / cloud
# -----------------------------------------------------------------------------
cask "codex"
cask "docker-desktop"
cask "gcloud-cli"

# -----------------------------------------------------------------------------
# Browsers
# -----------------------------------------------------------------------------
cask "brave-browser"
cask "google-chrome"

# -----------------------------------------------------------------------------
# Communication
# -----------------------------------------------------------------------------
cask "discord"
cask "signal"
cask "slack"
cask "telegram"

# -----------------------------------------------------------------------------
# AI
# -----------------------------------------------------------------------------
cask "chatgpt"
cask "claude"

# -----------------------------------------------------------------------------
# Passwords / secrets
# -----------------------------------------------------------------------------
cask "1password"
cask "gpg-suite"

# -----------------------------------------------------------------------------
# Databases
# -----------------------------------------------------------------------------
cask "postico"
cask "postgres-app"

# -----------------------------------------------------------------------------
# Utilities
# -----------------------------------------------------------------------------
cask "backblaze"
cask "blackhole-16ch"
cask "daisydisk"
cask "hazel"
cask "switchresx"

# -----------------------------------------------------------------------------
# Media / audio
# -----------------------------------------------------------------------------
cask "ableton-live-suite"
cask "audacity"
cask "obs"
cask "optimus-player"
cask "qbittorrent"
# rekordbox — pinned to v6, installed from vendor PKG in install.sh
# cask "rekordbox"
cask "soundsource"
cask "transmission"
cask "vlc"

# -----------------------------------------------------------------------------
# Manual installs (automated in install.sh via curl + hdiutil)
# -----------------------------------------------------------------------------
# SoulseekQt — https://www.slsknet.org (URL is date-stamped, update as needed)
# Spek       — https://github.com/alexkay/spek/releases

# -----------------------------------------------------------------------------
# Vendor downloads (not automatable — re-download from vendor when needed)
# -----------------------------------------------------------------------------
# Drobo Dashboard — https://www.drobo.com/start/
# NDI Tools       — https://ndi.video/tools/

# -----------------------------------------------------------------------------
# Mac App Store
# -----------------------------------------------------------------------------
mas "Xcode", id: 497799835
mas "Shazam", id: 897118787
mas "3Hub", id: 427515976
mas "Color Picker", id: 641027709
